Tutorials/HFDIBDEMFoam/fallingArbShaperParticle/system/fvSolution_OF4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    //~ {
        //~ solver          PCG;
        //~ tolerance       1e-08;
        //~ relTol          0.1;
        //~ preconditioner  DIC;
    //~ }
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0.05;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    5;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    //~ consistent         yes;
    consistent         no;
    
    residualControl
    {
        p
        {
            tolerance   1e-04;
            relTol      0;
        }
    }
}
// Note (20190104):
//  - this thing seems to work only for very specific combinations of
//    settings in fvSolution and it works only on a single core
//  - I have to clean up the code to make it robust (remove hanging
//    pointers and changing sizes of fields?!)

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    residualControl
    {
        p	1e-6;
        U	1e-6;
    }
    pRefCell 101;
    pRefValue 0;
    consistent yes;
}

relaxationFactors
{
    fields
    {
        p           0.8;
        //~ omega       0.5;
        //~ k           0.5;
        
        pFinal      1;
        //~ omegaFinal  1;
        //~ kFinal      1;
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
